blog/34.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 4.1.5 and 4.1.6
#+subtitle: 2024-07-17 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.5)

* Data as Programs
- One operational view of the meaning of a program: a program is a
  description of an abstract machine (Cf. the lecture).
- Example: ~factorial~.
- The evaluator can be thought of as a special machine that takes as
  input a description of a machine and emulates the machine whose
  description it takes.
- The evaluator could, for example, take ~factorial~ and be able to
  compute factorials.
- The evaluator can, therefore, be seen as a /universal machine/.
- ``This is striking'' (386)
- ``Another striking aspect of the evaluator is that it acts as a
  bridge between the data objects that are manipulated by our
  programming language and the programming language itself''. (386)
- ``That the user's program are the evaluator's data need not be a
  source of confusion.'' (386)
** Exercise 4.15
*Exercise*:

Given a one-argument procedure ~p~ and an object ~a~, ~p~ is said to
"halt" on ~a~ if evaluating the expression ~(p a)~ returns a value (as
opposed to terminating with an error message or running forever).
Show that it is impossible to write a procedure ~halts?~ that
correctly determines whether ~p~ halts on ~a~ for any procedure ~p~
and object ~a~.  Use the following reasoning: If you had such a
procedure ~halts?~, you could implement the following program:

#+begin_src scheme
  (define (run-forever) (run-forever))

  (define (try p)
    (if (halts? p p)
        (run-forever)
        'halted))
#+end_src

Now consider evaluating the expression ~(try try)~ and show that any
possible outcome (either halting or running forever) violates the
intended behavior of ~halts?~.[fn::Although we stipulated that
`halts?' is given a procedure object, notice that this reasoning still
applies even if `halts?' can gain access to the procedure's text and
its environment.  This is Turing's celebrated "Halting Theorem", which
gave the first clear example of a "non-computable" problem, i.e., a
well-posed task that cannot be carried out as a computational
procedure.]

*Answer*:

Suppose that applying ~try~ to ~try~ halts. If so, then, when calling
~(try try)~, we will call ~(run-forever)~ and, indeed, run forever.

Suppose that applying ~try~ to ~try~ does not halt. If so, then, when
calling ~(try try)~, we would return ~halted~.

So, this is the way I would put it: we have got a paradox. On the one
hand, if ~(try try)~ halts, then it doesn't halt. On the other hand,
if ~(try try)~ does not halt, then it halts.

* Internal Definitions
- Environment model of evaluation & metacircular evaluator: definition
  are executed ``in sequence, extending the environment frame one
  definition at a time.''

- ``This is particularly convenient for interactive program
  development...''

- ``However, if we think carefully about the internal definitions used
  to implement block structure [...] we will find that name-by-name
  extension of the environment may not be the best way to define local
  variables.''

- Example:
  #+begin_src scheme
    (define (f x)
      (define (even? n)
        (if (= n 0)
            true
            (odd? (- n 1))))
      (define (odd? n)
        (if (= n 0)
            false
            (even? (- n 1))))
      <REST OF BODY OF `F'>)
  #+end_src

- ``the only satisfactory interpretation of the two ~define~'s is to
  regard them as if the name ~even?~ and ~odd?~ were being added to
  the environment simultaneously.''

- ``More generally, in block structure, the scope of a local name is
  the entire procedure body in which the ~define~ is evaluated.''

- ``...our interpreter will evaluate calls to ~f~ correctly, but for
  an "accidental" reason...''

- There is ``a simple way to treat definitions so that internally
  defined names have truly simultaneous scope''...

- The procedure

  #+begin_src scheme
    (lambda <VARS>
      (define u <E1>)
      (define v <E2>)
      <E3>)
  #+end_src

  can be transformed into

  #+begin_src scheme
    (lambda <VARS>
      (let ((u '*unassigned*)
            (v '*unassigned*))
        (set! u <E1>)
        (set! v <E2>)
        <E3>))
  #+end_src

  ``where `*unassigned*' is a special symbol that causes looking up a
  variable to signal an error if an attempt is made to use the value
  of the not-yet-assigned variable.''
