blog/34.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-17 Wed 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 4.1.5 and 4.1.6</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 4.1.5 and 4.1.6
<br />
<span class="subtitle">2024-07-17 Wed</span>
</h1>
<div id="outline-container-orgd8dce31" class="outline-2">
<h2 id="orgd8dce31">Data as Programs</h2>
<div class="outline-text-2" id="text-orgd8dce31">
<ul class="org-ul">
<li>One operational view of the meaning of a program: a program is a
description of an abstract machine (Cf. the lecture).</li>
<li>Example: <code>factorial</code>.</li>
<li>The evaluator can be thought of as a special machine that takes as
input a description of a machine and emulates the machine whose
description it takes.</li>
<li>The evaluator could, for example, take <code>factorial</code> and be able to
compute factorials.</li>
<li>The evaluator can, therefore, be seen as a <i>universal machine</i>.</li>
<li>``This is striking'' (386)</li>
<li>``Another striking aspect of the evaluator is that it acts as a
bridge between the data objects that are manipulated by our
programming language and the programming language itself''. (386)</li>
<li>``That the user's program are the evaluator's data need not be a
source of confusion.'' (386)</li>
</ul>
</div>
<div id="outline-container-org99f1e85" class="outline-3">
<h3 id="org99f1e85">Exercise 4.15</h3>
<div class="outline-text-3" id="text-org99f1e85">
<p>
<b>Exercise</b>:
</p>

<p>
Given a one-argument procedure <code>p</code> and an object <code>a</code>, <code>p</code> is said to
"halt" on <code>a</code> if evaluating the expression <code>(p a)</code> returns a value (as
opposed to terminating with an error message or running forever).
Show that it is impossible to write a procedure <code>halts?</code> that
correctly determines whether <code>p</code> halts on <code>a</code> for any procedure <code>p</code>
and object <code>a</code>.  Use the following reasoning: If you had such a
procedure <code>halts?</code>, you could implement the following program:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">run-forever</span>) (run-forever))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">try</span> p)
  (<span style="color: #531ab6;">if</span> (halts? p p)
      (run-forever)
      'halted))
</pre>
</div>

<p>
Now consider evaluating the expression <code>(try try)</code> and show that any
possible outcome (either halting or running forever) violates the
intended behavior of <code>halts?</code>.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
<b>Answer</b>:
</p>

<p>
Suppose that applying <code>try</code> to <code>try</code> halts. If so, then, when calling
<code>(try try)</code>, we will call <code>(run-forever)</code> and, indeed, run forever.
</p>

<p>
Suppose that applying <code>try</code> to <code>try</code> does not halt. If so, then, when
calling <code>(try try)</code>, we would return <code>halted</code>.
</p>

<p>
So, this is the way I would put it: we have got a paradox. On the one
hand, if <code>(try try)</code> halts, then it doesn't halt. On the other hand,
if <code>(try try)</code> does not halt, then it halts.
</p>
</div>
</div>
</div>
<div id="outline-container-orge7472b9" class="outline-2">
<h2 id="orge7472b9">Internal Definitions</h2>
<div class="outline-text-2" id="text-orge7472b9">
<ul class="org-ul">
<li>Environment model of evaluation &amp; metacircular evaluator: definition
are executed ``in sequence, extending the environment frame one
definition at a time.''</li>

<li>``This is particularly convenient for interactive program
development&#x2026;''</li>

<li>``However, if we think carefully about the internal definitions used
to implement block structure [&#x2026;] we will find that name-by-name
extension of the environment may not be the best way to define local
variables.''</li>

<li><p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">f</span> x)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">even?</span> n)
    (<span style="color: #531ab6;">if</span> (= n 0)
        true
        (odd? (- n 1))))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">odd?</span> n)
    (<span style="color: #531ab6;">if</span> (= n 0)
        false
        (even? (- n 1))))
  &lt;REST OF BODY OF `F'&gt;)
</pre>
</div></li>

<li>``the only satisfactory interpretation of the two <code>define</code>'s is to
regard them as if the name <code>even?</code> and <code>odd?</code> were being added to
the environment simultaneously.''</li>

<li>``More generally, in block structure, the scope of a local name is
the entire procedure body in which the <code>define</code> is evaluated.''</li>

<li>``&#x2026;our interpreter will evaluate calls to <code>f</code> correctly, but for
an "accidental" reason&#x2026;''</li>

<li>There is ``a simple way to treat definitions so that internally
defined names have truly simultaneous scope''&#x2026;</li>

<li><p>
The procedure
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">lambda</span> <span style="color: #005f5f;">&lt;VARS&gt;</span>
  (<span style="color: #531ab6;">define</span> <span style="color: #721045;">u</span> <span style="color: #005f5f;">&lt;E1&gt;</span>)
  (<span style="color: #531ab6;">define</span> <span style="color: #721045;">v</span> <span style="color: #005f5f;">&lt;E2&gt;</span>)
  <span style="color: #005f5f;">&lt;E3&gt;</span>)
</pre>
</div>

<p>
can be transformed into
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">lambda</span> <span style="color: #005f5f;">&lt;VARS&gt;</span>
  (<span style="color: #531ab6;">let</span> ((u '*unassigned*)
        (v '*unassigned*))
    (set! u <span style="color: #005f5f;">&lt;E1&gt;</span>)
    (set! v <span style="color: #005f5f;">&lt;E2&gt;</span>)
    <span style="color: #005f5f;">&lt;E3&gt;</span>))
</pre>
</div>

<p>
``where `*unassigned*' is a special symbol that causes looking up a
variable to signal an error if an attempt is made to use the value
of the not-yet-assigned variable.''
</p></li>
</ul>
</div>
