blog/34.html
<div id="outline-container-org0202925" class="outline-3">
<h3 id="org0202925">Exercise 4.16</h3>
<div class="outline-text-3" id="text-org0202925">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In this exercise we implement the method just described for
interpreting internal definitions.  We assume that the evaluator
supports <code>let</code> (See Exercise 4.6).
</p>

<p>
a. Change <code>lookup-variable-value</code> (Section 4.1.3) to signal an error
if the value it finds is the symbol <code>*unassigned*</code>.
</p>

<p>
b. Write a procedure <code>scan-out-defines</code> that takes a procedure body
and returns an equivalent one that has no internal definitions, by
making the transformation described above.
</p>

<p>
c. Install <code>scan-out-defines</code> in the interpreter, either in
<code>make-procedure</code> or in <code>procedure-body</code> (section 4-1-3).  Which place
is better?  Why?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li><p>
a:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-variable-value</span> var env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (<span style="color: #531ab6;">if</span> (eq? (car vals) '*unassigned*)
                 (error <span style="color: #3548cf;">"not-yet-assigned variable"</span> var)
                 (car vals)))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))
</pre>
</div></li>

<li><p>
b:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">filter</span> pred seq)
  (<span style="color: #531ab6;">cond</span> ((null? seq)
         nil)
        ((pred (car seq))
         (cons (car seq)
               (filter pred (cdr seq))))
        (<span style="color: #531ab6;">else</span> (filter pred (cdr seq)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">append</span> l1 l2)
  (<span style="color: #531ab6;">if</span> (null? l1)
      l2
      (cons (car l1) (append (cdr l1) l2))))

<span style="color: #595959;">;; </span><span style="color: #595959;">example of a procedure body</span>
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">body-example</span>
  '((<span style="color: #531ab6;">define</span> <span style="color: #721045;">even?</span>
      (<span style="color: #531ab6;">lambda</span> (n)
        (<span style="color: #531ab6;">if</span> (= n 0)
            true
            (odd? (- n 1)))))
    (<span style="color: #531ab6;">define</span> <span style="color: #721045;">odd?</span>
      (<span style="color: #531ab6;">lambda</span> (n)
        (<span style="color: #531ab6;">if</span> (= n 0)
            false
            (even? (- n 1)))))
    (message <span style="color: #3548cf;">"hello world"</span>)
    (progn (* 3 3)
           (message <span style="color: #3548cf;">"foobar"</span>))
    (<span style="color: #531ab6;">define</span> <span style="color: #721045;">another-var</span>
      (* 3 2))))

<span style="color: #595959;">;; </span><span style="color: #595959;">return a list with:</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">car   (1st el): body without definitions</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">cadr  (2nd el): a list of the variables</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">caddr (3rd el): a list of the values for the variables</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">gp-build-lists</span> body body-no-defs vars vals)
  (<span style="color: #531ab6;">cond</span> ((null? body)
         (list body-no-defs vars vals)) <span style="color: #595959;">;; </span><span style="color: #595959;">we finished scanning, return results</span>
        ((eq? (caar body) 'define)
         (gp-build-lists (cdr body) <span style="color: #595959;">;; </span><span style="color: #595959;">filter definition out</span>
                         body-no-defs <span style="color: #595959;">;; </span><span style="color: #595959;">nothing to be addedd to new-body (we</span>
                         <span style="color: #595959;">;; </span><span style="color: #595959;">want the define to be gone)</span>
                         (cons (cadar body) vars) <span style="color: #595959;">;; </span><span style="color: #595959;">add var</span>
                         (cons (caddar body) vals))) <span style="color: #595959;">;; </span><span style="color: #595959;">add val</span>
        (<span style="color: #531ab6;">else</span> (gp-build-lists (cdr body)
                              (append body-no-defs (list (car body)))
                              vars
                              vals))))

<span style="color: #595959;">;; </span><span style="color: #595959;">map vars to lists whose car is the var and show cadr is the symbol</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">'*unassigned*</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">build-unassigned-vars</span> vars)
  <span style="color: #595959;">;; </span><span style="color: #595959;">we could use map, but I'm doing it manually</span>
  (<span style="color: #531ab6;">if</span> (null? vars)
      nil
      (cons (list (car vars) '*unassigned*) (build-unassigned-vars (cdr vars)))))

<span style="color: #595959;">;; </span><span style="color: #595959;">maps vars to lists whose car is the var and whose cadr is the</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">associated val</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">build-sets</span> vars vals)
  <span style="color: #595959;">;; </span><span style="color: #595959;">we could use map, but I'm doing it manually</span>
  (<span style="color: #531ab6;">if</span> (null? vars)
      nil
      (cons (list 'set! (car vars) (car vals))
            (build-sets (cdr vars) (cdr vals)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan-out-defines</span> body)
  (<span style="color: #531ab6;">let</span> ((lists (gp-build-lists body nil nil nil)))
    (<span style="color: #531ab6;">let</span> ((body-no-defs (car lists))
          (vars (cadr lists))
          (vals (caddr lists)))
      (append (append
               (cons 'let (list (build-unassigned-vars vars)))
               (build-sets vars vals))
              body-no-defs))))

<span style="color: #595959;">;; </span><span style="color: #595959;">example:</span>
(scan-out-defines body-example)
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(let ((another-var *unassigned*) (odd? *unassigned*) (even? *unassigned*))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(set! another-var (* 3 2))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(set! odd? (lambda (n) (if (= n 0) false (even? (- n 1)))))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(set! even? (lambda (n) (if (= n 0) true (odd? (- n 1)))))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(message "hello world")</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(progn (* 3 3) (message "foobar")))</span>
</pre>
</div></li>

<li><p>
c:
</p>

<p>
<code>Make-procedure</code> is used in <code>eval</code> to construct procedures.
<code>Procedure-body</code> is used in <code>apply</code> to select the bodies of
procedures.
</p>

<p>
I think it would be better to install <code>scan-out-defines</code> in
<code>make-procedure</code>, rather than in <code>procedure-body</code>, because we would
avoid calling <code>scan-out-defines</code> more than once for the same
procedure (<code>scan-out-defines</code> would be called for each application).
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-procedure</span> parameters body env)
  (list 'procedure parameters (scan-out-defines body) env))
</pre>
</div></li>
</ul>
</div>
</div>
