blog/34.html
<div id="outline-container-orgcc67426" class="outline-3">
<h3 id="orgcc67426">Exercise 4.17</h3>
<div class="outline-text-3" id="text-orgcc67426">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Draw diagrams of the environment in effect when evaluating the
expression &lt;e3&gt; in the procedure in the text, comparing how this will
be structured when definitions are interpreted sequentially with how
it will be structured if definitions are scanned out as described.
Why is there an extra frame in the transformed program?  Explain why
this difference in environment structure can never make a difference
in the behavior of a correct program.  Design a way to make the
interpreter implement the "simultaneous" scope rule for internal
definitions without constructing the extra frame.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The following is the environment structure when definition are
interpreted sequentially; &lt;e3&gt; is evaluated in E1.
</p>
<div class="org-src-container">
<pre class="src src-nil"> global env
      |
      V
+-------------+
| ...         |
|             |
+-------------+
       ^    ^        E1
       |    |         |
       |    |         V
 +---+-+-+  |    +-------------+
 | . | . |  +----+  u: e1      |
 +-+-+---+       |  v: e2      |
   |             +-------------+
   |
   V
 params: vars
 body: (define u &lt;E1&gt;)
       (define v &lt;E2&gt;)
       &lt;E3&gt;
</pre>
</div>

<p>
The following is the environment structure when definition are scanned
out; &lt;e3&gt; is evaluated in E2.
</p>
<div class="org-src-container">
<pre class="src src-nil">   global env
      |
      V
+-------------+
| ...         |
|             |
+-------------+
       ^    ^                 E1
       |    |                  |
       |    |                  V
 +---+-+-+  |             +-------------+
 | . | . |  +-------------+ vars        |
 +-+-+---+                |             |
   |                      +-------------+          E2
   |                                  ^             |
   V                                  |             V
 params: vars                         |  +-------------+
 body: (let ((u '*unassigned*)        +--+ u: e1       |
            (v '*unassigned*))           | v: e2       |
         (set! u &lt;E1&gt;)                   +-------------+
         (set! v &lt;E2&gt;)
         &lt;E3&gt;)
</pre>
</div>

<p>
In the second structure there is an extra frame because a <code>let</code> is
equivalent to the application of a lambda, and the application of a
lambda involves the creation of a new frame.
</p>

<p>
As long as <code>&lt;e3&gt;</code> is evaluated after <code>u</code> is set to <code>e1</code> and <code>v</code> to
<code>e2</code> there won't be any difference between the behaviuor in the two
environments, because there is no difference with respect to the
values of the bindings in the environment.
</p>

<p>
Simultaneous scope without an extra frame could be achieved by
transforming the body of the lambda so that all its internal
definitions come before all the rest (cf. the ``accidental reason'',
Authors mention, because calls to the example procedure <code>f</code> work).
</p>
</div>
</div>
<div id="outline-container-orgeb6277a" class="outline-3">
<h3 id="orgeb6277a">Exercise 4.19</h3>
<div class="outline-text-3" id="text-orgeb6277a">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Ben Bitdiddle, Alyssa P. Hacker, and Eva Lu Ator are arguing about the
desired result of evaluating the expression
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">let</span> ((a 1))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">f</span> x)
    (<span style="color: #531ab6;">define</span> <span style="color: #721045;">b</span> (+ a x))
    (<span style="color: #531ab6;">define</span> <span style="color: #721045;">a</span> 5)
    (+ a b))
  (f 10))
</pre>
</div>

<p>
Ben asserts that the result should be obtained using the sequential
rule for <code>define</code>: <code>b</code> is defined to be 11, then <code>a</code> is defined to be
5, so the result is 16.  Alyssa objects that mutual recursion requires
the simultaneous scope rule for internal procedure definitions, and
that it is unreasonable to treat procedure names differently from
other names. Thus, she argues for the mechanism implemented Exercise
4.16.  This would lead to <code>a</code> being unassigned at the time that the
value for <code>b</code> is to be computed.  Hence, in Alyssa's view the
procedure should produce an error.  Eva has a third opinion.  She says
that if the definitions of <code>a</code> and <code>b</code> are truly meant to be
simultaneous, then the value 5 for <code>a</code> should be used in evaluating
<code>b</code>.  Hence, in Eva's view <code>a</code> should be 5, <code>b</code> should be 15, and the
result should be 20.  Which (if any) of these viewpoints do you
support?  Can you devise a way to implement internal definitions so
that they behave as Eva prefers?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Both Ben's approach and Alyssa's approach seem okay to me.  As far as
I can see, a serious obstacle for Eva's approach is represented by
what we might call ``interdependent definitions''. For example, what
would we be supposed to do if the definitions of <code>b</code> and <code>a</code> were the
following?
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">b</span> (+ a x))
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">a</span> (b + 5))
</pre>
</div>
<p>
I cannot see a way to follow Eva's approach, given the possibility of
this kind of situations, can I?
</p>

<p>
(
</p>

<p>
Authors say that MIT Scheme generates an error.  Javascript raises an
error too, when evaluating equivalent code:
</p>

<div class="org-src-container">
<pre class="src src-javascript">((a) =&gt; {
  <span style="color: #531ab6;">function</span> <span style="color: #721045;">f</span>(<span style="color: #005e8b;">x</span>) {
    <span style="color: #531ab6;">let</span> <span style="color: #005e8b;">b</span> = a + x;
    <span style="color: #531ab6;">let</span> <span style="color: #005e8b;">a</span> = 5;
    <span style="color: #531ab6;">return</span> a + b;
  }
  f(10);
})(1)
<span style="color: #595959;">/*</span>
<span style="color: #595959;">  Uncaught ReferenceError: Cannot access 'a' before initialization</span>
<span style="color: #595959;">  at f (REPL11:4:15)</span>
<span style="color: #595959;">  at REPL11:9:5</span>
<span style="color: #595959;">*/</span>
</pre>
</div>

<p>
)
</p>
</div>
</div>
