blog/34.org
** Exercise 4.20
*Exercise*:

#+begin_quote
Because internal definitions look sequential but are actually
simultaneous, some people prefer to avoid them entirely, and use the
special form ~letrec~ instead.  ~Letrec~ looks like ~let~, so it is
not surprising that the variables it binds are bound simultaneously
and have the same scope as each other.  The sample procedure ~f~ above
can be written without internal definitions, but with exactly the same
meaning, as

#+begin_src scheme
  (define (f x)
    (letrec ((even?
              (lambda (n)
                (if (= n 0)
                    true
                    (odd? (- n 1)))))
             (odd?
              (lambda (n)
                (if (= n 0)
                    false
                    (even? (- n 1))))))
      <rest of body of f>))
#+end_src

~Letrec~ expressions, which have the form

#+begin_src scheme
  (letrec ((<var_1> <exp_1>) ... (<var_n> <exp_n>))
    <body>)
#+end_src

are a variation on ~let~ in which the expressions <exp_k> that
provide the initial values for the variables <var_k> are evaluated
in an environment that includes all the ~letrec~ bindings.  This
permits recursion in the bindings, such as the mutual recursion of
~even?~ and ~odd?~ in the example above, or the evaluation of 10
factorial with

#+begin_src scheme
  (letrec ((fact
            (lambda (n)
              (if (= n 1)
                  1
                  (* n (fact (- n 1)))))))
    (fact 10))
#+end_src

a. Implement ~letrec~ as a derived expression, by transforming a
~letrec~ expression into a ~let~ expression as shown in the text above
or in Exercise 4.18. That is, the ~letrec~ variables should be created
with a ~let~ and then be assigned their values with ~set!~.

b. Louis Reasoner is confused by all this fuss about internal
definitions.  The way he sees it, if you don't like to use ~define~
inside a procedure, you can just use ~let~.  Illustrate what is loose
about his reasoning by drawing an environment diagram that shows the
environment in which the ~<rest of body of f>~ is evaluated during
evaluation of the expression ~(f 5)~, with ~f~ defined as in this
exercise.  Draw an environment diagram for the same evaluation, but
with ~let~ in place of ~letrec~ in the definition of ~f~.
#+end_quote

*Answer*:

a:

#+begin_src scheme
  (define (append l1 l2)
    (if (null? l1)
        l2
        (cons (car l1) (append (cdr l1) l2))))

  (define example-letrec
    '(letrec ((even?
               (lambda (n)
                 (if (= n 0)
                     true
                     (odd? (- n 1)))))
              (odd?
               (lambda (n)
                 (if (= n 0)
                     false
                     (even? (- n 1))))))
       (message "ciao")
       (message "hola")))

  (define (letrec-body exp)
    (cddr exp))

  (define (letrec-bindings exp)
    (cadr exp))

  (define (letrec-vars bindings)
    (if (null? bindings)
        nil
        (cons (caar bindings) (letrec-vars (cdr bindings)))))

  (define (letrec-vals bindings)
    (if (null? bindings)
        nil
        (cons (cadar bindings) (letrec-vals (cdr bindings)))))

  (define (letrec-build-unassigned-vars vars)
    (if (null? vars)
        nil
        (cons (list (car vars) '*unassigned*) (letrec-build-unassigned-vars (cdr vars)))))

  (define (letrec-build-sets vars vals)
    (if (null? vars)
        nil
        (cons (list 'set! (car vars) (car vals))
              (letrec-build-sets (cdr vars) (cdr vals)))))

  (define (letrec-to-let exp)
    (append
     (cons 'let (list (letrec-build-unassigned-vars (letrec-vars (letrec-bindings exp)))))
     (append (letrec-build-sets (letrec-vars (letrec-bindings exp))
                                (letrec-vals (letrec-bindings exp)))
             (letrec-body exp))))

  (letrec-to-let example-letrec)
  ;; =>
  ;; (let ((even? *unassigned*) (odd? *unassigned*))
  ;;   (set! even? (lambda (n) (if (= n 0) true (odd? (- n 1)))))
  ;;   (set! odd? (lambda (n) (if (= n 0) false (even? (- n 1)))))
  ;;   (message "ciao")
  ;;   (message "hola"))
#+end_src

b:

I had a bit of trouble doing part b of the exercise. But, after
looking on the web for what people have said and asking for help...,
the following should be the correct drawings. The key thing to notice,
assuming this is correct, is that, when using ~let~ (which is just a
lambda; see p. 64), the expressions whose evaluation gives the values
of the ~let~ bindings are not evaluated in the context of the new
frame created by the ~let~, but they are evaluated in the context of
the frame to which the new frame created by the ~let~ points to (that
is, its ``enclosing environment''). In a sense, we can say, they are
evaluated while the new frame is in the process of being created.

#+begin_src
  When using letrec, <rest of body of f> is evaluated in the following E2 frame:

        E0
    +-------------------+
    |f:--+              |
    |    |              |
    |    |              |
    +----+--------------+
         |   ^    ^
         |   |    |
         V   |    |                 E1
  +---+---+  |    |   +--+------+---------+
  | | |  -+--+    +---+x: 5               |
  +-+-+---+           +-------------------+
    |                          ^
    V                          |
   ...                         |
                               |    E2
                       +-------+------------+
                       | even?:-------------+---------------+
                       |                    |               |
                       |                    |<-----------   |
                       | odd?:---+          |            \  |
                       +---------+----------+             \ V
                                 |     ^             +---+-\-+
                                 |     |             | | |   +
                                 |     |             +-+-+---+
                                 V     |               |
                            +---+---+  |               |
                            | | |  -+--+               V
                            +-+-+---+                 ...
                              |
                              |
                              V
                             ...
#+end_src

#+begin_src
  When using let, <rest of body of f> is evaluated in the following E2 frame:

      E0
    +-------------------+
    |f:--+              |
    |    |              |
    |    |              |
    +----+--------------+
         |   ^    ^
         |   |    |
         V   |    |                 E1
  +---+---+  |    |   +--+------+---------+ <----------------------------+
  | | |  -+--+    +---+x: 5               | <---------------------+      |
  +-+-+---+           +-------------------+                       |      |
    |                          ^                                  |      |
    V                          |                                  |      |
   ...                         |                                  |      |
                               |    E2                            |      |
                       +-------+------------+                     |      |
                       | even?:-------------+---------------+     |      |
                       |                    |               |     |      |
                       |                    |               |     |      |
                       | odd?:---+          |               |     |      |
                       +---------+----------+               V     |      |
                                 |                   +---+---+    |      |
                                 |                   | | |  -+----+      |
                                 |                   +-+-+---+           |
                                 V                     |                 |
                            +---+---+                  |                 |
                            | | |   +---------+        V                 |
                            +-+-+---+         |       ...                |
                              |               |                          |
                              |               |                          |
                              V               |                          |
                             ...              |                          |
                                              |                          |
                                              +--------------------------+
#+end_src

