blog/34.html
<div id="outline-container-orgbbb43a8" class="outline-3">
<h3 id="orgbbb43a8">Exercise 4.20</h3>
<div class="outline-text-3" id="text-orgbbb43a8">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Because internal definitions look sequential but are actually
simultaneous, some people prefer to avoid them entirely, and use the
special form <code>letrec</code> instead.  <code>Letrec</code> looks like <code>let</code>, so it is
not surprising that the variables it binds are bound simultaneously
and have the same scope as each other.  The sample procedure <code>f</code> above
can be written without internal definitions, but with exactly the same
meaning, as
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">f</span> x)
  (<span style="color: #531ab6;">letrec</span> ((even?
            (<span style="color: #531ab6;">lambda</span> (n)
              (<span style="color: #531ab6;">if</span> (= n 0)
                  true
                  (odd? (- n 1)))))
           (odd?
            (<span style="color: #531ab6;">lambda</span> (n)
              (<span style="color: #531ab6;">if</span> (= n 0)
                  false
                  (even? (- n 1))))))
    &lt;rest of body of f&gt;))
</pre>
</div>

<p>
<code>Letrec</code> expressions, which have the form
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">letrec</span> ((<span style="color: #005f5f;">&lt;var_1&gt;</span> <span style="color: #005f5f;">&lt;exp_1&gt;</span>) ... (<span style="color: #005f5f;">&lt;var_n&gt;</span> <span style="color: #005f5f;">&lt;exp_n&gt;</span>))
  <span style="color: #005f5f;">&lt;body&gt;</span>)
</pre>
</div>

<p>
are a variation on <code>let</code> in which the expressions &lt;exp<sub>k</sub>&gt; that
provide the initial values for the variables &lt;var<sub>k</sub>&gt; are evaluated
in an environment that includes all the <code>letrec</code> bindings.  This
permits recursion in the bindings, such as the mutual recursion of
<code>even?</code> and <code>odd?</code> in the example above, or the evaluation of 10
factorial with
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">letrec</span> ((fact
          (<span style="color: #531ab6;">lambda</span> (n)
            (<span style="color: #531ab6;">if</span> (= n 1)
                1
                (* n (fact (- n 1)))))))
  (fact 10))
</pre>
</div>

<p>
a. Implement <code>letrec</code> as a derived expression, by transforming a
<code>letrec</code> expression into a <code>let</code> expression as shown in the text above
or in Exercise 4.18. That is, the <code>letrec</code> variables should be created
with a <code>let</code> and then be assigned their values with <code>set!</code>.
</p>

<p>
b. Louis Reasoner is confused by all this fuss about internal
definitions.  The way he sees it, if you don't like to use <code>define</code>
inside a procedure, you can just use <code>let</code>.  Illustrate what is loose
about his reasoning by drawing an environment diagram that shows the
environment in which the <code>&lt;rest of body of f&gt;</code> is evaluated during
evaluation of the expression <code>(f 5)</code>, with <code>f</code> defined as in this
exercise.  Draw an environment diagram for the same evaluation, but
with <code>let</code> in place of <code>letrec</code> in the definition of <code>f</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
a:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">append</span> l1 l2)
  (<span style="color: #531ab6;">if</span> (null? l1)
      l2
      (cons (car l1) (append (cdr l1) l2))))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">example-letrec</span>
  '(<span style="color: #531ab6;">letrec</span> ((even?
             (<span style="color: #531ab6;">lambda</span> (n)
               (<span style="color: #531ab6;">if</span> (= n 0)
                   true
                   (odd? (- n 1)))))
            (odd?
             (<span style="color: #531ab6;">lambda</span> (n)
               (<span style="color: #531ab6;">if</span> (= n 0)
                   false
                   (even? (- n 1))))))
     (message <span style="color: #3548cf;">"ciao"</span>)
     (message <span style="color: #3548cf;">"hola"</span>)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-body</span> exp)
  (cddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-bindings</span> exp)
  (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-vars</span> bindings)
  (<span style="color: #531ab6;">if</span> (null? bindings)
      nil
      (cons (caar bindings) (letrec-vars (cdr bindings)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-vals</span> bindings)
  (<span style="color: #531ab6;">if</span> (null? bindings)
      nil
      (cons (cadar bindings) (letrec-vals (cdr bindings)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-build-unassigned-vars</span> vars)
  (<span style="color: #531ab6;">if</span> (null? vars)
      nil
      (cons (list (car vars) '*unassigned*) (letrec-build-unassigned-vars (cdr vars)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-build-sets</span> vars vals)
  (<span style="color: #531ab6;">if</span> (null? vars)
      nil
      (cons (list 'set! (car vars) (car vals))
            (letrec-build-sets (cdr vars) (cdr vals)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">letrec-to-let</span> exp)
  (append
   (cons 'let (list (letrec-build-unassigned-vars (letrec-vars (letrec-bindings exp)))))
   (append (letrec-build-sets (letrec-vars (letrec-bindings exp))
                              (letrec-vals (letrec-bindings exp)))
           (letrec-body exp))))

(letrec-to-let example-letrec)
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(let ((even? *unassigned*) (odd? *unassigned*))</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(set! even? (lambda (n) (if (= n 0) true (odd? (- n 1)))))</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(set! odd? (lambda (n) (if (= n 0) false (even? (- n 1)))))</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(message "ciao")</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(message "hola"))</span>
</pre>
</div>

<p>
b:
</p>

<p>
I had a bit of trouble doing part b of the exercise. But, after
looking on the web for what people have said and asking for help&#x2026;,
the following should be the correct drawings. The key thing to notice,
assuming this is correct, is that, when using <code>let</code> (which is just a
lambda; see p. 64), the expressions whose evaluation gives the values
of the <code>let</code> bindings are not evaluated in the context of the new
frame created by the <code>let</code>, but they are evaluated in the context of
the frame to which the new frame created by the <code>let</code> points to (that
is, its ``enclosing environment''). In a sense, we can say, they are
evaluated while the new frame is in the process of being created.
</p>

<div class="org-src-container">
<pre class="src src-nil">When using letrec, &lt;rest of body of f&gt; is evaluated in the following E2 frame:

      E0
  +-------------------+
  |f:--+              |
  |    |              |
  |    |              |
  +----+--------------+
       |   ^    ^
       |   |    |
       V   |    |                 E1
+---+---+  |    |   +--+------+---------+
| | |  -+--+    +---+x: 5               |
+-+-+---+           +-------------------+
  |                          ^
  V                          |
 ...                         |
                             |    E2
                     +-------+------------+
                     | even?:-------------+---------------+
                     |                    |               |
                     |                    |&lt;-----------   |
                     | odd?:---+          |            \  |
                     +---------+----------+             \ V
                               |     ^             +---+-\-+
                               |     |             | | |   +
                               |     |             +-+-+---+
                               V     |               |
                          +---+---+  |               |
                          | | |  -+--+               V
                          +-+-+---+                 ...
                            |
                            |
                            V
                           ...
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">When using let, &lt;rest of body of f&gt; is evaluated in the following E2 frame:

    E0
  +-------------------+
  |f:--+              |
  |    |              |
  |    |              |
  +----+--------------+
       |   ^    ^
       |   |    |
       V   |    |                 E1
+---+---+  |    |   +--+------+---------+ &lt;----------------------------+
| | |  -+--+    +---+x: 5               | &lt;---------------------+      |
+-+-+---+           +-------------------+                       |      |
  |                          ^                                  |      |
  V                          |                                  |      |
 ...                         |                                  |      |
                             |    E2                            |      |
                     +-------+------------+                     |      |
                     | even?:-------------+---------------+     |      |
                     |                    |               |     |      |
                     |                    |               |     |      |
                     | odd?:---+          |               |     |      |
                     +---------+----------+               V     |      |
                               |                   +---+---+    |      |
                               |                   | | |  -+----+      |
                               |                   +-+-+---+           |
                               V                     |                 |
                          +---+---+                  |                 |
                          | | |   +---------+        V                 |
                          +-+-+---+         |       ...                |
                            |               |                          |
                            |               |                          |
                            V               |                          |
                           ...              |                          |
                                            |                          |
                                            +--------------------------+
</pre>
</div>
</div>
</div>
